app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.page(params[:page]).per(2)

INSERT INTO "users" ("admin", "created_at", "email", "firstname", "lastname", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
      if @user.save