app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (title LIKE '%Spheeris%' OR director LIKE '%Spheeris%') AND (runtime_in_minutes > 90 and runtime_in_minutes < 120 )

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "runtime_in_minutes" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["runtime_in_minutes", 98765], ["updated_at", Tue, 01 Mar 2016 04:06:30 UTC +00:00]]