app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.build(review_params)
    @review.user_id = current_user.id

    if @reviews.save
---
INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def load_movie
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]